#### ParameterDefinition Property

---

|  |
| --- |
| ColorFillScheme Class   See Also |

Represents the parameter of the elements that this scheme could be used to color.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public ElementId ParameterDefinition { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ParameterDefinition As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ParameterDefinition { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Remarks

When this property changed, all existing scheme entries will be removed from the scheme, and the value of  IsByRange  property will be set to false if the parameter storage type is not numeric.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The paramId cannot be applied to the scheme. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ColorFillScheme Class

Autodesk.Revit.DB Namespace